Revit 2027 API
ExportLinetypeTableIterator.MoveNext Method
 Increments the iterator to the next item.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool MoveNext()
Public Overridable Function MoveNext As Boolean
public:
virtual bool MoveNext()
abstract MoveNext : unit -> bool
override MoveNext : unit -> bool
Return Value
Boolean
 True if the iteration has no more items. False if there are more items to be iterated.
See Also
Reference
ExportLinetypeTableIterator Class
Autodesk.Revit.DB Namespace